include/KBWSSoapBinding.runSsearch.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://soap.g-language.org/KBWS">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:runSsearch>
   <in0></in0>
   <params>
    <d></d>
    <moltype></moltype>
    <histogram>false</histogram>
    <nucleotide>false</nucleotide>
    <topstrand>false</topstrand>
    <bottomstrand>false</bottomstrand>
    <gapopen>0</gapopen>
    <gapext>0</gapext>
    <scores>0</scores>
    <alignments>0</alignments>
    <ktup>0</ktup>
    <matrix></matrix>
    <eupper>0.0</eupper>
    <elower>0.0</elower>
    <dbrange></dbrange>
    <seqrange></seqrange>
   </params>
  </ns1:runSsearch>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
